simulacoes/bump/mhdPimpleFoam/tranSonicoMHD/sim3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;


vertices
(
    (0 0 0)                     //ponto 0
    (0.333333333 0 0)           //ponto 1
    (0.666666666 0 0)           //ponto 2
    (1 0 0)                     //ponto 3
    (1 0.333333333 0)           //ponto 4
    (0.666666666 0.333333333 0) //ponto 5
    (0.333333333 0.333333333 0) //ponto 6
    (0 0.333333333 0)           //ponto 7
    
    (0 0 0.333333333)                     //ponto 8
    (0.333333333 0 0.333333333)           //ponto 9
    (0.666666666 0 0.333333333)           //ponto 10
    (1 0 0.333333333)                     //ponto 11
    (1 0.333333333 0.333333333)           //ponto 12
    (0.666666666 0.333333333 0.333333333) //ponto 13
    (0.333333333 0.333333333 0.333333333) //ponto 14
    (0 0.333333333 0.333333333)           //ponto 15
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (20 20 5) simpleGrading (0.18527689745 1 1)
    hex (1 2 5 6 9 10 13 14) (50 20 5) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13) (20 20 5) simpleGrading (5.39732699401 1 1)
);

edges
(
    arc 1 2 (0.5 0.033333333 0)
    arc 9 10 (0.5 0.033333333 0.333333333)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 15 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 11 12 4)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (7 6 14 15)
            (6 5 13 14)
            (5 4 12 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (8 9 14 15)
            (9 10 13 14)
            (10 11 12 13)
            (1 0 7 6)
            (2 1 6 5)
            (3 2 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
